/**
 * 全局注入
 * 依赖弹窗
 */

const statusMapping = {
    '1': '提交成功',
    '4': '账号含有不合法字符',
    '-6': '未登录',
    '7': '验证码错误',
    '8': '账号不存在',
    '9': '账号尚未启用',
    '10': '账号已过期(停用)',
    '11': '账号不存在',
    '12': '密码不正确',
    '13': '密码过期',
    '15': '安全问题答案验证失败',
    '16': '登录超时，请重新登录',
    '18': 'IP地址验证失败',
    '204': '必须与登录密码保持一致',
    '205': '请输入旧密码',
    '206': '请输入新密码',
    '207': '两次输入必须相同',
    '208': '原始密码不正确',
    '209': '安全密码不正确',
    '211': "您的登录密码已经修改成功！请在下次登录时使用新密码！",
    '212': "您的安全密码已经修改成功！",
    '213': '安全密码未设定',
    '210': '密码不合法',
    '301': 'Tel不合法',
    '302': 'QQ不合法',
    '303': '真实姓名不合法',
    '305': '账号和邮箱不匹配',
    '306': '找回登录密码记录不存在',
    '307': '邮件发送失败',
    '308': '每天邮箱找回密码限3次',
    '309': '安全邮箱验证链接错误',
    '310': '安全邮箱验证链接已失效',
    '311': '邮件地址不合法',
    '312': '银行卡号不合法',
    '314': '抱歉，您未绑定银行卡',
    '316': '3分钟内不允许重复申请验证码!',
    '317': '请填写已验证的手机号码！',
    '315': '对不起，您还不是VIP!',
    '401': '基本信息已经更新!',
    '402': '银行资料已经更新!',
    '501': '请稍等，您上次的提款还未处理！',
    '502': '提交失败，单次提款不能少于100元！',
    '503': '您的提款要求已送出，我们会尽快为您处理',
    '504': '您的主账户余额不足',
    '506': '您当前存在提款限额，无法申请提款',
    '601': '内容不合法',
    '602': '提交内容不能为空',
    '607': '类型错误',
    '608': '提交金额为空',
    '611': '问题答案错误',
    '617': '该银行已绑定过银行卡！',
    '707': '未达到当前支付方式的最低存款金额{0}元',
    '708': '已超出当前支付方式的最大存款金额{0}元',
    '709': '已超出当前支付方式每天存款次数限制！',
    '710': '此订单已完成，请检查您的存款记录！',
    '711': '交易信息无效，请检查！',
    '712': '您的账号无法查找到符合条件的订单！',
    '713': '交易信息已过期(只支持2天内的订单)！',
    '714': '订单号验证失败！',
    '716': '抱歉，入帐失败，请稍后重试，如问题继续请联系在线客服！',
    '728': '抱歉，此银行账户不支持自助入账！',

    '-1': '未知系统错误',
    '-3': '信息不能为空',
    '-5': '验证失败，请重新载入',
    '-9': '系统错误！请稍后重试。',
    '-10': '游戏平台维护中',
    '-11': '余额获取失败，请手动刷新',


    //自助入账
    '718': '您的订单信息已锁定，请稍后在试',
    '719': '由于网络延时，您提交的订单请在倒计时后再次尝试',
    '720': '您自助入账操作太频繁，请倒计时后进行自助入账',
    '724': '当前通道已关闭，请使用其它存款通道',
    '730': '当前账户已停止自助入账',
    '8005': '对不起，自助入账暂时关闭',
    '312': '您输入的银行卡号不正确',
    //支付宝
    '725': '您已经超过了今天的存款最大次数，请用支付宝转银行卡通道存款',
    '726': '对不起，当前订单提交未超过10分钟，不可以取消！',
    '727': '此支付通道繁忙，请稍后再试或选择其它支付方式',

    '902': '登录失败，请重新登录！',
    '904': 'MG帐号未激活，如有问题请联系客服人员',
    //验证
    '951': '手机验证成功！',
    '952': '邮箱验证成功！',
    '953': '密码验证成功！',
    '954': '安全密码验证成功',
    '955': '安全问题验证成功！',
    '956': '手机验证失败！',
    '957': '邮箱验证失败！',
    '958': '密码验证失败！',
    '959': '安全密码验证失败！',
    '960': '安全问题验证失败！',
    '962': '验证失败！',
    '963': '没有验证项！',
    '964': '手机验证码发送成功！',
    '965': '邮箱验证码发送成功！',
    '966': '手机验证码发送失败！',
    '967': '邮箱验证码发送失败！',
    '968': '每天邮箱验证不能超过三次！',
    '969': '发送短信的次数超过当天最大次数',
    '971': '您填写的手机号码与注册手机号码不符！',
    '972': '您填写的邮箱与注册邮箱不符！',
    '975': '验证码不合法！',
    '976': '十分钟内不允许重复申请验证码！',
    //短信修改银行卡号
    '977': '发送验证码类型不能为空！',
    '978': '验证码不能为空！',
    '979': '用户名不能为空！',
    '980': '没有修改银行卡号的相关验证信息！',
    '981': '银行卡号修改成功！',
    '982': '银行卡号修改失败！',
    '961': '银行卡验证失败！',
    '983': '验证码超时！',
    '985': '银行卡资料没有变更！',
    '1000': '{0}不存在！',
    '1005': '账号不存在！',
    //游戏
    '1002': "进入游戏失败，请稍后再试。",
    //自助首存优惠begin
    '1201': '首存优惠正在审核，请勿重复申请！',
    '1202': '您已申请过首存优惠，请勿重复申请！',
    '1203': '抱歉，您首次存款金额小于50元，不符合申请条件！',
    '1204': '抱歉，您的注册IP已申请过首存优惠，如有问题请联系客服！',//抱歉，您不符合申请条件，如有问题请联系客服！
    '1205': '抱歉，您的登陆IP已申请过首存优惠，如有问题请联系客服！',
    '1206': '抱歉，您的登陆IP已申请过首存优惠，如有问题请联系客服！',
    '1207': '抱歉，您的银行卡已申请过首存优惠，如有问题请联系客服！',
    '1208': '抱歉，申请失败，请联系客服！',
    '1209': '您的帐号未存款，更多优惠可查看官网“优惠活动”！',
    '1301': '申请成功，请耐心等待审核！',
    '1304': '请勿重复领取彩金!',
    '1302': '不要急，活动还未开始！',
    '1303': '对不起，活动已经结束！',
    '1305': '您的账号存在套利风险，活动期间新注册会员总存款金额50元以上方可领取国庆彩金！',
    '1307':"您已经申领过礼金",
    '1309': '该自助优惠功能已暂停使用，请稍后重试!',
    '1310': '系统正在核对您的洗码，请稍后重试',
    '1312': '相同电话号码的用户已领取过认证礼金',
    '1313': '相同邮箱地址的用户已领取过认证礼金',
    '1314': '相同银行信息的用户已领取过认证礼金',
    //周勤
    "1602": "未达到申领礼金条件",
    "1603": "领奖时间还未开始",
    "1605": "已领过周勤",

    '2005': '账号已经被使用！',
    '2006': '您的银行资料已完善，请勿重复提交!',
    '3000': '余额不足',
    '8001': '账号不可为空白！',
    '8002': '您已超过最大提交次数',
    '8004': '您已超过最大提交次数',
    //自助首存优惠end
    '8003': '您的注册信息已存在,请勿重复注册！',
    //短信设置
    '8081': '恭喜您！短信功能已经为您提交成功！',
    '8082': '提交失败！',

    //AstroPay  edit by kobe,2017/05/20
    '10001': '此卡资金不充足！',
    '10002': '此卡状态异常！',
    '10003': '输入的金额无效！',
    '10004': '此卡过期的日期无效！',
    '10005': '此卡已过期！',
    '10006': '订单重复，请稍后再试',
    '10013': '此卡片代码无效，请检查后再试！',
    //RequestWithdrawalCommand 申请提款返回
    '1316': '您当前存在洗码限额，无法申请提款',

}

/**
 * 添加对应状态码中文信息
 * @param {*ResponseData} 服务器返回的数据
 */
export default function statusToCNmessageHanlder(data) {
    if (data && data.Status) {
        let msg = statusMapping[data.Status]
        if (msg) data.CNMessage = msg;
    }
    return data;
}
