export const data = {
  topTitle:"周勤礼金",
  title:"全勤礼金周周送，最高可达8888元！",
  validTime:"活动时间：长期有效",
  content:'<h1 class="title">活动介绍</h1>'+
  '<p>腾博会会员只要在一周内，累计四天有进行游戏投注，且这四天之中，每日有效投注额不小于300元，周有效投注额不小于5000元，即可获得相应的全勤奖金！</p>'+
'<h1>活动时间</h1>'+
'<p>本活动为长期活动。</p>'+
'<h1>各平台统计时间</h1>'+
'<p>PT、AG、GG捕鱼、波音、YP街机 每周一中午12:00 至 下周一中午11:59:59。<br/><em style="color:#f98;">例：星期一中午12点 到 星期二上午11点59分59秒，算作一天。</em><br/><br/>'+
'MG国际每周一上午8:00 至 下周一上午07:59:59。<br/><em style="color:#f98;">例：星期一上午8点 到 星期二上午7点59分59秒，算作一天。</em><br/><br/>'+
'TTG、DT、SW每周一上午00:00:00 至 周日晚上23:59:59。<br/><em style="color:#f98;">例：星期一凌晨0点 到 当天晚上23点59分59秒，算作一天。</em><br/></p>'+
'<h1>全勤礼金计算</h1>'+
'<table class="tb-tab1" width="100%" border="0" cellspacing="0" cellpadding="0">'+
'  <tbody>'+
'  <tr>'+
  '<th width="23%">周累计出勤</th>'+
'<th width="50%">周有效投注额(元)</th>'+
'<th>周勤礼金(元)</th>'+
'</tr>'+
'<tr>'+
'<td>最少4天</td>'+
'<td>5,000 至 49,999.99</td>'+
'<td>18</td>'+
'</tr>'+
'<tr>'+
'<td>最少4天</td>'+
'<td>50,000 至 99,999.99</td>'+
'<td>58</td>'+
'</tr>'+
'<tr>'+
'<td>最少4天</td>'+
'<td>100,000 至 499,999.99</td>'+
'<td>168</td>'+
'</tr>'+
'<tr>'+
'<td>最少4天</td>'+
'<td>500,000 至 999,999.99</td>'+
'<td>688</td>'+
'</tr>'+
'<tr>'+
'<td>最少4天</td>'+
'<td>1,000,000 至 4,999,999.99</td>'+
'<td>1588</td>'+
'</tr>'+
'<tr>'+
'<td>最少4天</td>'+
'<td>5,000,000 至 9,999,999.99</td>'+
'<td>5888</td>'+
'</tr>'+
'<tr>'+
'<td>最少4天</td>'+
'<td>10,000,000以上</td>'+
'<td>8888</td>'+
'</tr>'+
'</tbody>'+
'</table>'+
'<p>例1：会员A上周累计4天登录平台进行游戏，有3天单日有效投注额均超过300元，且上周有效投注额超过5000元。但是，该会员有1天的有效投注未达到300元，那么TA无法获得周勤奖励。</p>' +
  '<p>例2：会员B上周累计4天登录平台进行游戏，这4天单日有效投注额均超过300元。但是该会员上周有效投注额未达到5000元，那么TA也无法获得周勤奖励。</p>'+
'<h1>活动细则</h1>'+
'<ol class="rules-ol">'+
  '<li>1.活动对象：所有会员。</li>'+
'<li>2.领取时间：<em>每周二14:00</em>之前，系统会完成<em>上一周</em>投注情况的统计，达到条件的会员可在每<em>周二14:00:00</em> 至 <em>周日23:59:59</em>这个时间段内，通过【个人中心】的【自助优惠】页进行自助领取上一周的全勤奖励。</li>'+
'<li>3.若用户在规定的时间内未进行领取，则视为自动放弃。奖励不会累加到下一周的全勤奖当中。</li>'+
'<li>4.<em>如用户正在参与首存优惠，将无法同时参与本活动</em>。</li>'+
'<li>5.所有客户只能拥有一个账号：同一个IP、同一个存/提款卡、同一个手机号码、同一个邮箱都视为同一客户，如果发现同一个人拥有两个或以上的账户，重复的账户将会被冻结，【腾博会】保留索回重复账户的奖励及盈利的权利。</li>'+
'<li>6.需要一倍流水才可提款。</li>'+
'<li>7.该活动若存在文字理解的差异，则最终解释权归【腾博会】所有，且【腾博会】有权结束、缩短、延长该活动。</li>'+
'</ol>'+
 '<style>' +
  'h1{font-size:0.26rem;color:#222;margin: 0.2rem 0 0.15rem 0;} ' +
  'p,li{line-height: 1.5;margin:0.15rem 0;} ' +
  'em{color:red;} ' +
  'table{border-collapse:collapse;border-spacing: 0; text-align: left} ' +
  'th{padding: 0.2rem 0 0.2rem 0.15rem;background: #231a32;color: #fff;border:1px solid #231a32;} ' +
  'td{padding:0.15rem 0 0.15rem 0.15rem;border:1px solid #231a32;}'+
  '</style>'

};

