export const data = {
  topTitle:"天天洗码",
  title:"天天洗码无上限！超高返水1.7%",
  validTime:"时间：永久有效",
  content:'<h1>什么是洗码？</h1>\
<p>洗码是会员在游戏过程中，根据其有效投注额减去流水限额后，按一定比例进行的返利。</p>\
  <h1>什么是流水限额？</h1>\
<p>会员在参与某些特定的优惠活动时，其提款要求的游戏投注金额无法进行洗码优惠，这类需要抵扣掉的有效投注额就是流水限额。<br/>如用户不参与此类活动，就不会产生流水限额。</p>\
  <h1>洗码金额的计算方式</h1>\
  <p>（会员所有平台总流水 - 洗码流水限额）* 洗码比率 = 洗码金额。<br/>注：【平台总流水】必须大于【洗码流水限额】才可进行洗码统计。</p>\
<h1>会员洗码返点比例 <span style="color:#999;font-size:12px;font-weight: 500;">(支持 PT / MG国际 / TTG / DT / SW 老虎机电游积分)</span></h1>\
 <table>\
  <tr><th width="17%">会员级别</th> <th width="17%">周投注额</th><th  width="17%">洗码比例</th><th  width="17%">电游积分</th><th width="13%">总洗码</th> <th>结算时间 </th></tr>\
  <tr><td>普通VIP</td><td>≥0</td><td>0.80%</td><td>0.50%</td><td>1.30%</td><td>洗码达到1元可随时领取</td></tr>\
<tr><td>青铜VIP</td><td>≥50万</td><td>0.85%</td><td>0.50%</td><td>1.35%</td><td>洗码达到1元可随时领取</td></tr>\
<tr><td>白银VIP</td><td>≥300万</td><td>0.90%</td><td>0.50%</td><td>1.40%</td><td>洗码达到1元可随时领取</td></tr>\
<tr><td>黄金VIP</td><td>≥500万</td><td>1.00%</td><td>0.50%</td><td>1.50%</td><td>洗码达到1元可随时领取</td></tr>\
<tr><td>钻石VIP</td><td>≥800万</td><td>1.10%</td><td>0.50%</td><td>1.60%</td><td>洗码达到1元可随时领取</td></tr>\
<tr><td>至尊VIP</td><td>≥1200万</td><td>1.20%</td><td>0.50%</td><td>1.70%</td><td>洗码达到1元可随时领取</td></tr>\
</table>\
<p>例1：会员A为普通VIP，平时享受0.8% 洗码退水。在某一周的有效投注额达到了800万，成为了钻石VIP会员，根据钻石VIP的洗码比例，他将永久享受1.1%的洗码退水比例。</p>\
<p>例2：会员B是黄金VIP，平时享受1%洗码退水，如果他进行PT老虎机游戏的话，他还将获得额外0.5%的PT洗码积分返水！</p>\
 <h1>[腾博会] 洗码特色</h1>\
 <table>\
  <tr>\
  <th width="20%">游戏种类</th>\
  <th width="20%">亮点特色</th>\
  <th width="20%">天天洗码</th>\
  <th width="20%">返水高额</th>\
  <th width="20%">提现要求 </th>\
  </tr>\
  <tr>\
  <td>适用于PT平台、MG国际平台、AG平台、TTG平台、GG捕鱼、DT平台、YP街机、SW厅、波音平台下电游以及体育类等所有游戏</td>\
<td>对首次存款的用户超高奖励（首存优惠58%）后自动升级为VIP会员并享有天天0.8%洗码退水</td>\
<td>所有VIP会员可实时结算洗码</td>\
  <td >最高可达1.7% 高额洗码</td>\
<td>金额上限不封顶。洗码金额可直接提款</td>\
</tr>\
</table>\
 <h1>活动细则</h1>\
  <ul>\
<li>1.洗码统计时间：PT、MG国际、AG、BBIN、GG捕鱼、TTG、DT、YP街机、SW 洗码为实时统计。</li>\
<li>2.自助洗码需在【个人中心】的【自助优惠】页面进行申领，只要派送金额不小于1元即可领取。</li>\
<li>3.如会员不进行自助领取投注洗码的操作，系统将在每周一上午10:00前自动发放上一周未领取的洗码礼金。</li>\
<li>4.洗码优惠金额无上限，多投多得。您可以选择继续投注游戏也可以申请提款。</li>\
<li>5.如派发不参与洗码的优惠红利，将自动发放当前已累计的洗码金额。</li>\
<li>6.洗码优惠与首存优惠不能同时享受。</li>\
<li>7.所有无风险投注不计有效投注额；无风险投注包含以下状况：\
<p>（1）. 所有拒绝投注、无效投注、打平或是赔率低于0.5，将不包括及计算于投注金额内。</p>\
<p>（2）. 任何「取消注单」或「和局」的投注额将不予计算有效投注。 </p>\
</li>\
<li>8.该活动若存在文字理解的差异，则最终解释权归【腾博会】所有，且【腾博会】有权结束、缩短、延长该活动。</li>\
</ul>'+
 '<style>' +
  'h1{font-size:0.26rem;color:#222;margin: 0.2rem 0 0.15rem 0;} ' +
  'p,li{line-height: 1.5;margin:0.15rem 0;} ' +
  'table{border-collapse:collapse;border-spacing: 0; text-align: left;width: 100%;margin-bottom:0.25rem} ' +
  'th{padding: 0.2rem 0 0.2rem 0.15rem;background: #231a32;color: #fff;border:1px solid #231a32;} ' +
  'td{padding:0.15rem 0 0.15rem 0.15rem;border:1px solid #231a32;}'+
  '</style>'

};

